Autodesk.Revit.DB.Lighting.PointLightShape.#ctor(Autodesk.Revit.DB.Lighting.PointLightShape)
Creates a copy of the given point light shape
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013